{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.0.1",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_24",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_69",
              "trainable": true,
              "batch_input_shape": [
                null,
                784
              ],
              "dtype": "float32",
              "units": 200,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_70",
              "trainable": true,
              "units": 200,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_71",
              "trainable": true,
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "lr": 0.0010000000474974513,
          "momentum": 0,
          "decay": 0,
          "nesterov": false
        }
      },
      "loss": "sparse_categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_69/kernel",
          "shape": [
            784,
            200
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_69/bias",
          "shape": [
            200
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_70/kernel",
          "shape": [
            200,
            200
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_70/bias",
          "shape": [
            200
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_71/kernel",
          "shape": [
            200,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_71/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
